  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/add-firewall` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/d54ac425-d91d-4bb1-8364-d2efe374a49f/terraform-bin plan -no-color -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.eastus2-firewall.azurerm_firewall.firewall will be created
+ resource "azurerm_firewall" "firewall" {
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "eastus2-firewall"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku_name            = "AZFW_VNet"
    + sku_tier            = "Standard"
    + threat_intel_mode   = (known after apply)
    + zones               = [
        + "1",
        + "2",
        + "3",
      ]

    + ip_configuration {
        + name                 = "configuration"
        + private_ip_address   = (known after apply)
        + public_ip_address_id = (known after apply)
        + subnet_id            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/AzureFirewallSubnet"
      }
  }

# module.eastus2-firewall.azurerm_firewall_policy.policy will be created
+ resource "azurerm_firewall_policy" "policy" {
    + child_policies           = (known after apply)
    + firewalls                = (known after apply)
    + id                       = (known after apply)
    + location                 = "eastus2"
    + name                     = "eastus2-firewall-policy"
    + resource_group_name      = "org-jcetina-repo-baklava-rg"
    + rule_collection_groups   = (known after apply)
    + sku                      = (known after apply)
    + threat_intelligence_mode = "Alert"
  }

# module.eastus2-firewall.azurerm_public_ip.firewall_ip will be created
+ resource "azurerm_public_ip" "firewall_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus2"
    + name                    = "eastus2-firewall-pip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

  </details>